
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 24 to add, 1 to change, 21 to destroy.</code></pre>

* Create
  * local_file.govuk_frontend_css
  * local_file.main_css
  * local_file.template_html
* Update
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;10&#34;]
  * azurerm_storage_blob.b2c_config[&#34;11&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]
  * azurerm_storage_blob.b2c_config[&#34;13&#34;]
  * azurerm_storage_blob.b2c_config[&#34;14&#34;]
  * azurerm_storage_blob.b2c_config[&#34;15&#34;]
  * azurerm_storage_blob.b2c_config[&#34;16&#34;]
  * azurerm_storage_blob.b2c_config[&#34;17&#34;]
  * azurerm_storage_blob.b2c_config[&#34;18&#34;]
  * azurerm_storage_blob.b2c_config[&#34;19&#34;]
  * azurerm_storage_blob.b2c_config[&#34;2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;20&#34;]
  * azurerm_storage_blob.b2c_config[&#34;3&#34;]
  * azurerm_storage_blob.b2c_config[&#34;4&#34;]
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]
  * azurerm_storage_blob.b2c_config[&#34;6&#34;]
  * azurerm_storage_blob.b2c_config[&#34;7&#34;]
  * azurerm_storage_blob.b2c_config[&#34;8&#34;]
  * azurerm_storage_blob.b2c_config[&#34;9&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "927796ab4471100bcc4486d56dcf9c7f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/main.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["1"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "2d511145205655b408407beb2d25a206" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/govuk-frontend-5.2.0.min.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["10"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-mask.svg"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["11"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "57a05afc1fc634420a02ff0151675de0" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-crest-2x.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["12"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-opengraph-image.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["13"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "eef7f360c29c4ef113b058b4d7677550" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-512.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["14"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "e1321ba525137ed156ed48e69369531c" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/favicon.svg"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["15"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "77bfa2d75a6f14154f13588014ee25f6" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/manifest.json"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["16"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/bold-b542beb274-v2.woff2"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["17"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/light-f591b13f7d-v2.woff"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["18"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "94a07e06a104e76fe40583f74b204aee" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/light-94a07e06a1-v2.woff2"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["19"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/bold-affa96571d-v2.woff"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "9509139712f25775a153a8cee0d9c736" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/govuk-frontend-5.2.0.min.css.map"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["20"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "1c7dad0407e4e48fcd6cdc552fd10861" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/b2c.js"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["3"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "7c42cc5ccbfbde50efefdc697bcb4cc9" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/govuk-frontend-5.2.0.min.js.map"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["4"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "b20d2e74fe816b4da5e7fc6a26b54b25" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/govuk-frontend-5.2.0.min.js"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "cfff66539cf6edd54423729830e4129f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "template.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["6"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-crest.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["7"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/favicon.ico"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["8"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-180.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["9"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "2c48a90c9944fc69e87574d06646f3ec" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-192.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # local_file.govuk_frontend_css will be created
  + resource "local_file" "govuk_frontend_css" {
      + content              = <<-EOT
            @charset "UTF-8";:root{--govuk-frontend-version:"5.2.0";--govuk-frontend-breakpoint-mobile:20rem;--govuk-frontend-breakpoint-tablet:40.0625rem;--govuk-frontend-breakpoint-desktop:48.0625rem}.govuk-link{font-family:GDS Transport,arial,sans-serif;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;text-decoration:underline;text-decoration-thickness:max(1px,.0625rem);text-underline-offset:.1578em}
            /*! Copyright (c) 2011 by Margaret Calvert & Henrik Kubel. All rights reserved. The font has been customised for exclusive use on gov.uk. This cut is not commercially available. */@font-face{font-family:GDS Transport;font-style:normal;font-weight:400;src:url(https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2) format("woff2"),url(https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff) format("woff");font-display:fallback}@font-face{font-family:GDS Transport;font-style:normal;font-weight:700;src:url(https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2) format("woff2"),url(https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff) format("woff");font-display:fallback}@media print{.govuk-link{font-family:sans-serif}}.govuk-link:hover{text-decoration-thickness:max(3px,.1875rem,.12em);-webkit-text-decoration-skip-ink:none;text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;text-decoration-skip:none}.govuk-link:focus{outline:3px solid #0000;background-color:#fd0;box-shadow:0 -2px #fd0,0 4px #0b0c0c;text-decoration:none;-webkit-box-decoration-break:clone;box-decoration-break:clone}.govuk-link:link{color:#1d70b8}.govuk-link:visited{color:#4c2c92}.govuk-link:hover{color:#003078}.govuk-link:active,.govuk-link:focus{color:#0b0c0c}@media print{[href^="/"].govuk-link:after,[href^="http://"].govuk-link:after,[href^="https://"].govuk-link:after{content:" (" attr(href) ")";font-size:90%;word-wrap:break-word}}.govuk-link--muted:link,.govuk-link--muted:visited{color:#505a5f}.govuk-link--muted:active,.govuk-link--muted:focus,.govuk-link--muted:hover,.govuk-link--text-colour:link,.govuk-link--text-colour:visited{color:#0b0c0c}@media print{.govuk-link--text-colour:link,.govuk-link--text-colour:visited{color:#000}}.govuk-link--text-colour:hover{color:#0b0c0cfc}.govuk-link--text-colour:active,.govuk-link--text-colour:focus{color:#0b0c0c}@media print{.govuk-link--text-colour:active,.govuk-link--text-colour:focus{color:#000}}.govuk-link--inverse:link,.govuk-link--inverse:visited{color:#fff}.govuk-link--inverse:active,.govuk-link--inverse:hover{color:#fffffffc}.govuk-link--inverse:focus{color:#0b0c0c}.govuk-link--no-underline:not(:hover):not(:active){text-decoration:none}.govuk-link--no-visited-state:link,.govuk-link--no-visited-state:visited{color:#1d70b8}.govuk-link--no-visited-state:hover{color:#003078}.govuk-link--no-visited-state:active,.govuk-link--no-visited-state:focus{color:#0b0c0c}.govuk-link-image{display:inline-block;line-height:0;text-decoration:none}.govuk-link-image:focus{outline:3px solid #0000;box-shadow:0 0 0 4px #fd0,0 0 0 8px #0b0c0c}.govuk-list{font-family:GDS Transport,arial,sans-serif;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;font-weight:400;font-size:1rem;line-height:1.25;color:#0b0c0c;margin-top:0;margin-bottom:15px;padding-left:0;list-style-type:none}@media print{.govuk-list{font-family:sans-serif}}@media (min-width:40.0625em){.govuk-list{font-size:1.1875rem;line-height:1.3157894737}}@media print{.govuk-list{font-size:14pt;line-height:1.15;color:#000}}@media (min-width:40.0625em){.govuk-list{margin-bottom:20px}}.govuk-list .govuk-list{margin-top:10px}.govuk-list>li{margin-bottom:5px}.govuk-list--bullet{padding-left:20px;list-style-type:disc}.govuk-list--number{padding-left:20px;list-style-type:decimal}.govuk-list--bullet>li,.govuk-list--number>li{margin-bottom:0}@media (min-width:40.0625em){.govuk-list--bullet>li,.govuk-list--number>li{margin-bottom:5px}}.govuk-list--spaced>li{margin-bottom:10px}@media (min-width:40.0625em){.govuk-list--spaced>li{margin-bottom:15px}}.govuk-heading-xl{color:#0b0c0c;font-family:GDS Transport,arial,sans-serif;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;font-weight:700;font-size:2rem;line-height:1.09375;display:block;margin-top:0;margin-bottom:30px}@media print{.govuk-heading-xl{color:#000;font-family:sans-serif}}@media (mi

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

, .intro, div .attrEntry div, .error, .attrEntry label {
                font-family: sans-serif;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-body-m, .govuk-body, .intro, div .attrEntry div, .error, .attrEntry label {
                font-size: 19px;
                font-size: 1.1875rem;
                line-height: 1.31579;
              }
            }
            
            @media print {
              .govuk-body-m, .govuk-body, .intro, div .attrEntry div, .error, .attrEntry label {
                font-size: 14pt;
                line-height: 1.15;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-body-m, .govuk-body, .intro, div .attrEntry div, .error, .attrEntry label {
                margin-bottom: 20px;
              }
            }
            
            .govuk-body-m + .govuk-heading-l, .govuk-body + .govuk-heading-l, .intro + .govuk-heading-l, div .attrEntry div + .govuk-heading-l, .error + .govuk-heading-l, .attrEntry label + .govuk-heading-l,
            .govuk-body-s + .govuk-heading-l,
            .govuk-list + .govuk-heading-l {
              padding-top: 15px;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-body-m + .govuk-heading-l, .govuk-body + .govuk-heading-l, .intro + .govuk-heading-l, div .attrEntry div + .govuk-heading-l, .error + .govuk-heading-l, .attrEntry label + .govuk-heading-l,
              .govuk-body-s + .govuk-heading-l,
              .govuk-list + .govuk-heading-l {
                padding-top: 20px;
              }
            }
            
            .govuk-body-m + .govuk-heading-m, .govuk-body + .govuk-heading-m, .intro + .govuk-heading-m, div .attrEntry div + .govuk-heading-m, .error + .govuk-heading-m, .attrEntry label + .govuk-heading-m,
            .govuk-body-s + .govuk-heading-m,
            .govuk-list + .govuk-heading-m,
            .govuk-body-m + .govuk-heading-s,
            .govuk-body + .govuk-heading-s,
            .intro + .govuk-heading-s,
            div .attrEntry div + .govuk-heading-s,
            .error + .govuk-heading-s,
            .attrEntry label + .govuk-heading-s,
            .govuk-body-s + .govuk-heading-s,
            .govuk-list + .govuk-heading-s {
              padding-top: 5px;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-body-m + .govuk-heading-m, .govuk-body + .govuk-heading-m, .intro + .govuk-heading-m, div .attrEntry div + .govuk-heading-m, .error + .govuk-heading-m, .attrEntry label + .govuk-heading-m,
              .govuk-body-s + .govuk-heading-m,
              .govuk-list + .govuk-heading-m,
              .govuk-body-m + .govuk-heading-s,
              .govuk-body + .govuk-heading-s,
              .intro + .govuk-heading-s,
              div .attrEntry div + .govuk-heading-s,
              .error + .govuk-heading-s,
              .attrEntry label + .govuk-heading-s,
              .govuk-body-s + .govuk-heading-s,
              .govuk-list + .govuk-heading-s {
                padding-top: 10px;
              }
            }
            
            #api {
              font-family: "GDS Transport",arial,sans-serif;
            }
            
            #api .create a {
              margin-left: 10px;
            }
            
            div .attrEntry div.error {
              color: #d4351c;
              display: none;
            }
            
            div .attrEntry div.show {
              display: block !important;
            }
            
            .error {
              color: #d4351c !important;
            }
            
            .entry-item {
              margin-bottom: 30px;
            }
            
            .entry-item input,
            .textInput  {
              font-family: 'GDS Transport', arial, sans-serif;
              font-size: 19px;
              font-size: 1.1875rem;
              line-height: 1.31579;
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
            
              -webkit-writing-mode: horizontal-tb !important;
              text-rendering: auto;
              color: -internal-light-dark(black, white);
              letter-spacing: normal;
              word-spacing: normal;
              line-height: normal;
              text-transform: none;
              text-indent: 0px;
              text-shadow: none;
              display: inline-block;
              text-align: start;
              appearance: auto;
              -webkit-rtl-ordering: logical;
              cursor: text;
            
              font-weight: 400;
              font-size: 16px;
              font-size: 1rem;
              line-height: 1.25;
              box-sizing: border-box;
              width: 250px;
              height: 40px;
              margin-top: 0;
              padding: 5px;
              border: 2px solid #0b0c0c;
              border-radius: 0;
              -webkit-appearance: none;
              -moz-appearance: none;
              appearance: none;
            }
            
            .entry-item label, .attrEntry label {
              font-size: 19px;
              font-size: 1.1875rem;
              line-height: 1.31579;
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              line-height: 1.25;
              color: #0b0c0c;
              display: block;
              margin-bottom: 5px;
            }
            
            .attr > ul {
              list-style: none;
              padding: 0;
              margin: 0;
            }
            
            .attrEntry {
              margin-bottom: 30px;
            }
            
            .helpLink {
              margin-top: 10px;
              display: block;
            }
            
            .buttons {
              margin-top: 10px;
            }
            
            input[type="checkbox"] {
              width: 44px;
              height: 44px;
              margin: 0;
              cursor: pointer;
              outline: 2px solid #000000;
              border: 0;
              opacity: 1;
              accent-color: #ffffff;
            }
            
            #api .helpLink {
              display: none;
            }
            
            #api .verify {
              margin-top: 20px;
              margin-right: 0;
            }
            
            #api .verify label {
              display: block;
              width: 100%;
            }
            
            #api .verify input {
              display: block;
              margin-right: 25%;
            }
            
            #api .verify button {
              display: block;
              margin-top: 20px;
              margin-right: 0;
              margin-bottom: 0;
            }
            #api .verify .verifyButton {
              margin-right: 15px;
            }
            #attributeVerification #attributeList {
              border-bottom: 1px solid #b1b4b6;
              margin-bottom: 25px;
            }
            #api #retryCode {
              cursor: pointer;
            }
            .changeClaims {
              visibility: hidden;
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "b2c/views/css/main.css"
      + id                   = (known after apply)
    }

  # local_file.template_html will be created
  + resource "local_file" "template_html" {
      + content              = <<-EOT
            <!DOCTYPE html>
            <html lang="en" class="govuk-template">
              <head>
                <title>Pre-Recorded Evidence Account - GOV.UK</title>
            
                <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
                <meta name="theme-color" content="#0b0c0c">
            
                <link rel="stylesheet" href="https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css">
            
                <link rel="manifest" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json">
                <link rel="icon" sizes="48x48" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico">
                <link rel="icon" sizes="any" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" type="image/svg+xml">
                <link rel="mask-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" color="#0b0c0c">
                <link rel="apple-touch-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png">
            
                <script src="https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" defer></script>
              </head>
              <body class="govuk-template__body">
                <script>document.body.className += ' js-enabled' + ('noModule' in HTMLScriptElement.prototype ? ' govuk-frontend-supported' : '');</script>
            
                <a href="#main-content" class="govuk-skip-link" data-module="govuk-skip-link">Skip to main content</a>
                <header class="govuk-header" role="banner" data-module="govuk-header">
                  <div class="govuk-header__container govuk-width-container">
                    <div class="govuk-header__logo">
                      <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__link--homepage">
                        <svg focusable="false" role="img" class="govuk-header__logotype" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 148 30" height="30" width="148" aria-label="GOV.UK">
                          <title>GOV.UK</title>
                          <path d="M22.6 10.4c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m-5.9 6.7c-.9.4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m10.8-3.7c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s0 2-1 2.4m3.3 4.8c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4M17 4.7l2.3 1.2V2.5l-2.3.7-.2-.2.9-3h-3.4l.9 3-.2.2c-.1.1-2.3-.7-2.3-.7v3.4L15 4.7c.1.1.1.2.2.2l-1.3 4c-.1.2-.1.4-.1.6 0 1.1.8 2 1.9 2.2h.7c1-.2 1.9-1.1 1.9-2.1 0-.2 0-.4-.1-.6l-1.3-4c-.1-.2 0-.2.1-.3m-7.6 5.7c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m-5 3c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s.1 2 1 2.4m-3.2 4.8c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m14.8 11c4.4 0 8.6.3 12.3.8 1.1-4.5 2.4-7 3.7-8.8l-2.5-.9c.2 1.3.3 1.9 0 2.7-.4-.4-.8-1.1-1.1-2.3l-1.2 4c.7-.5 1.3-.8 2-.9-1.1 2.5-2.6 3.1-3.5 3-1.1-.2-1.7-1.2-1.5-2.1.3-1.2 1.5-1.5 2.1-.1 1.1-2.3-.8-3-2-2.3 1.9-1.9 2.1-3.5.6-5.6-2.1 1.6-2.1 3.2-1.2 5.5-1.2-1.4-3.2-.6-2.5 1.6.9-1.4 2.1-.5 1.9.8-.2 1.1-1.7 2.1-3.5 1.9-2.7-.2-2.9-2.1-2.9-3.6.7-.1 1.9.5 2.9 1.9l.4-4.3c-1.1 1.1-2.1 1.4-3.2 1.4.4-1.2 2.1-3 2.1-3h-5.4s1.7 1.9 2.1 3c-1.1 0-2.1-.2-3.2-1.4l.4 4.3c1-1.4 2.2-2 2.9-1.9-.1 1.5-.2 3.4-2.9 3.6-1.9.2-3.4-.8-3.5-1.9-.2-1.3 1-2.2 1.9-.8.7-2.3-1.2-3-2.5-1.6.9-2.2.9-3.9-1.2-5.5-1.5 2-1.3 3.7.6 5.6-1.2-.7-3.1 0-2 2.3.6-1.4 1.8-1.1 2.1.1.2.9-.3 1.9-1.5 2.1-.9.2-2.4-.5-3.5-3 .6 0 1.2.3 2 .9l-1.2-4c-.3 1.1-.7 1.9-1.1 2.3-.3-.8-.2-1.4 0-2.7l-2.9.9C1.3 23 2.6 25.5 3.7 30c3.7-.5 7.9-.8 12.3-.8m28.3-11.6c0 .9.1 1.7.3 2.5.2.8.6 1.5 1 2.2.5.6 1 1.1 1.7 1.5.7.4 1.5.6 2.5.6.9 0 1.7-.1 2.3-.4s1.1-.7 1.5-1.1c.4-.4.6-.9.8-1.5.1-.5.2-1 .2-1.5v-.2h-5.3v-3.2h9.4V28H55v-2.5c-.3.4-.6.8-1 1.1-.4.3-.8.6-1.3.9-.5.2-1 .4-1.6.6s-1.2.2-1.8.2c-1.5 0-2.9-.3-4-.8-1.2-.6-2.2-1.3-3-2.3-.8-1-1.4-2.1-1.8-3.4-.3-1.4-.5-2.8-.5-4.3s.2-2.9.7-4.2c.5-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.6 2.6-.8 4.1-.8 1 0 1.9.1 2.8.3.9.2 1.7.6 2.4 1s1.4.9 1.9 1.5c.6.6 1 1.3 1.4 2l-3.7 2.1c-.2-.4-.5-.9-.8-1.2-.3-.4-.6-.7-1-1-.4-.3-.8-.5-1.3-.7-.5-.2-1.1-.2-1.7-.2-1 0-1.8.2-2.5.6-.7.4-1.3.9-1.7 1.5-.5.6-.8 1.4-1 2.2-.3.8-.4 1.9-.4 2.7zM71.5 6.8c1.5 0 2.9.3 4.2.8 1.2.6 2.3 1.3 3.1 2.3.9 1 1.5 2.1 2 3.4s.7 2.7.7 4.2-.2 2.9-.7 4.2c-.4 1.3-1.1 2.4-2 3.4-.9 1-1.9 1.7-3.1 2.3-1.2.6-2.6.8-4.2.8s-2.9-.3-4.2-.8c-1.2-.6-2.3-1.3-3.1-2.3-.9-1-1.5-2.1-2-3.4-.4-1.3-.7-2.7-.7-4.2s.2-2.9.7-4.2c.4-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.5 2.6-.8 4.2-.8zm0 17.6c.9 0 1.7-.2 2.4-.5s1.3-.8 1.7-1.4c.5-.6.8-1.3 1.1-2.2.2-.8.4-1.7.4-2.7v-.1c0-1-.1-1.9-.4-2.7-.2-.8-.6-1.6-1.1-2.2-.5-.6-1.1-1.1-1.7-1.4-.7-.3-1.5-.5-2.4-.5s-1.7.2-2.4.5-1.3.8-1.7 1.4c-.5.6-.8 1.3-1.1 2.2-.2.8-.4 1.7-.4 2.7v.1c0 1 .1 1.9.4 2.7.2.8.6 1.6 1.1 2.2.5.6 1.1 1.1 1.7 1.4.6.3 1.4.5 2.4.5zM88.9 28 83 7h4.7l4 15.7h.1l4-15.7h4.7l-5.9 21h-5.7zm28.8-3.6c.6 0 1.2-.1 1.7-.3.5-.2 1-.4 1.4-.8.4-.4.7-.8.9-1.4.2-.6.3-1.2.3-2v-13h4.1v13.6c0 1.2-.2 2.2-.6 3.1s-1 1.7-1.8 2.4c-.7.7-1.6 1.2-2.7 1.5-1 .4-2.2.5-3.4.5-1.2 0-2.4-.2-3.4-.5-1-.4-1.9-.9-2.7-1.5-.8-.7-1.3-1.5-1.8-2.4-.4-.9-.6-2-.6-3.1V6.9h4.2v13c0 .8.1 1.4.3 2 .2.6.5 1 .9 1.4.4.4.8.6 1.4.8.6.2 1.1.3 1.8.3zm13-17.4h4.2v9.1l7.4-9.1h5.2l-7.2 8.4L148 28h-4.9l-5.5-9.4-2.7 3V28h-4.2V7zm-27.6 16.1c-1.5 0-2.7 1.2-2.7 2.7s1.2 2.7 2.7 2.7 2.7-1.2 2.7-2.7-1.2-2.7-2.7-2.7z"></path>
                        </svg>
                      </a>
                    </div>
                    <div class="govuk-header__content">
                      <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__service-name">
                        HMCTS Pre-Recorded Evidence Service
                      </a>
                    </div>
                  </div>
                </header>
            
                <main class="govuk-main-wrapper" id="main-content" role="main">
                  <div class="govuk-width-container">
                      <div class="govuk-grid-row">
                        <div class="govuk-grid-column-two-thirds">
            
                          <div id="api">
                            <!-- B2C content goes here -->
                          </div>
            
                        </div>
                      </div>
                  </div>
                </main>
            
                <footer class="govuk-footer" role="contentinfo">
                  <div class="govuk-width-container">
                    <div class="govuk-footer__meta">
                      <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
                        <h2 class="govuk-visually-hidden">Support links</h2>
                        <ul class="govuk-footer__inline-list">
                          <li class="govuk-footer__inline-list-item">
                            <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">
                              Terms and conditions
                            </a>
                          </li>
                          <li class="govuk-footer__inline-list-item">
                            <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/accessibility-statement" target="_blank">
                              Accessibility statement
                            </a>
                          </li>
                        </ul>
                        <svg aria-hidden="true" focusable="false" class="govuk-footer__licence-logo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 483.2 195.7" height="17" width="41">
                          <path fill="currentColor" d="M421.5 142.8V.1l-50.7 32.3v161.1h112.4v-50.7zm-122.3-9.6A47.12 47.12 0 0 1 221 97.8c0-26 21.1-47.1 47.1-47.1 16.7 0 31.4 8.7 39.7 21.8l42.7-27.2A97.63 97.63 0 0 0 268.1 0c-36.5 0-68.3 20.1-85.1 49.7A98 98 0 0 0 97.8 0C43.9 0 0 43.9 0 97.8s43.9 97.8 97.8 97.8c36.5 0 68.3-20.1 85.1-49.7a97.76 97.76 0 0 0 149.6 25.4l19.4 22.2h3v-87.8h-80l24.3 27.5zM97.8 145c-26 0-47.1-21.1-47.1-47.1s21.1-47.1 47.1-47.1 47.2 21 47.2 47S123.8 145 97.8 145"></path>
                        </svg>
                        <span class="govuk-footer__licence-description">
                            All content is available under the
                            <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                        </span>
                      </div>
                      <div class="govuk-footer__meta-item">
                        <a class="govuk-footer__link govuk-footer__copyright-logo" href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">© Crown copyright</a>
                      </div>
                    </div>
                  </div>
                </footer>
              </body>
            </html>
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "b2c/views/template.html"
      + id                   = (known after apply)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (39 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          - cors_rule {
              - allowed_headers    = [
                  - "",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://hmctsprodextid.b2clogin.com",
                ] -> null
              - exposed_headers    = [
                  - "",
                ] -> null
              - max_age_in_seconds = 0 -> null
            }
          - cors_rule {
              - allowed_headers    = [
                  - "",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://hmctsdemoextid.b2clogin.com",
                ] -> null
              - exposed_headers    = [
                  - "",
                ] -> null
              - max_age_in_seconds = 0 -> null
            }

            # (4 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 24 to add, 1 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":781,"Program":"tfcmt","SHA1":"","Vars":{}} -->